app/views/posts/_form.html.erb

    <%= f.label :tag_tokens, "Tags" %><br />
    <%= f.text_field :tag_tokens, "data-pre" => @post.tags.map(&:attributes).to_json %>
---
SELECT "tags".* FROM "tags" INNER JOIN "classifications" ON "tags"."id" = "classifications"."tag_id" WHERE "classifications"."post_id" = 1