app/views/posts/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = 1
---
    <td><%= post.published? ? t(:_yes) : t(:_no) %></td>
    <td><%= truncate post.tags.collect{|t| t.name}.to_s, :length => 250, :omission => " (...)" %></td>