app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    current_page = params[:page] ||= 1
    @posts = Post.page current_page

INSERT INTO "posts" ("author", "body", "created_at", "pub_date", "published", "status", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "pub_date" = '2012-09-02', "updated_at" = '2012-02-12 19:19:45.829821' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])