app/controllers/tags_controller.rb

  def index
    @tags = Tag.where("name like ?", "%#{params[:q]}%")

    respond_to do |format|
      format.html # index.html.erb
      format.json { render :json => @tags.map(&:attributes) }
---
SELECT "tags".* FROM "tags" WHERE (name like '%a%')
SELECT "tags".* FROM "tags"

  def edit
    @tag = Tag.find(params[:id])
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @tag = Tag.new(params[:tag])

    respond_to do |format|
      if @tag.save
---
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 11 Feb 2012 21:41:00 UTC +00:00], ["name", "tag1"], ["updated_at", Sat, 11 Feb 2012 21:41:00 UTC +00:00]]